
#ifndef __K40_SPI_WITHFIFO_H_
#define __K40_SPI_WITHFIFO_H_


#ifdef __cplusplus
extern "C" {
#endif


/*********************************************************************************************************
  移植本软件包时需要修改以下的函数或宏
*********************************************************************************************************/


/*********************************************************************************************************
  片选引脚 CS
*********************************************************************************************************/

#define SPI_CS_LOW()     {GPIOD_PCOR |= 1ul << 0; spiMsDelay(500);}    /* 片选引脚 输出低电平          */
#define SPI_CS_HIGH()    {spiMsDelay(500); GPIOD_PSOR |= 1ul << 0;}    /* 片选引脚 输出高电平          */


/*********************************************************************************************************
  函数声明
*********************************************************************************************************/
void  spi0Init(void);

void  spiTxRxByte(INT8U  *pucTxBuf, INT8U  ucTxNum,
                  INT8U  *pucRxBuf, INT8U  ucRxNum);

void  Send_Byte(INT8U ucData);

INT32U  Get_Byte(void);

void  spiMsDelay(INT32U  ulDly);
void SPI_WriteByte(uint8_t TxData);
uint8_t SPI_ReadByte(void);
void SPI_CrisEnter(void);
void SPI_CrisExit(void);
void SPI_CS_Select(void);
void SPI_CS_Deselect(void);



#ifdef __cplusplus
}
#endif


#endif 


/*********************************************************************************************************
** END FILE 
*********************************************************************************************************/
