/****************************************Copyright (c)**************************************************
**                               Guangzou ZLG-MCU Development Co.,LTD.
**                                      graduate school
**                                 http://www.zlgmcu.com
**
**--------------File Info-------------------------------------------------------------------------------
** File Name:               MX25L1606Drv.h
** Last modified date:      2007-04-25
** Last version:            V1.0
** Descriptions:            mx25L1606驱动程序头文件
**
**------------------------------------------------------------------------------------------------------
** Created By:              Litiantian
** Created date:            2007-04-25
** Version:                 V1.0
** Descriptions:            The original version 初始版本
**
**------------------------------------------------------------------------------------------------------
** Modified by:     
** Modified date:   
** Version:         
** Descriptions:    
**
********************************************************************************************************/
#ifndef __MX25L1606DRV_H_
#define __MX25L1606DRV_H_


#ifdef __cplusplus
extern "C" {
#endif


/*********************************************************************************************************
  变量
*********************************************************************************************************/
enum  PARAMETER_TYPE {Invalid};                                         /* 定义1个常量,代表无效参数     */

typedef enum  erType{Sec1,Sec8,Sec16,Chip}      ERTYPE;
typedef enum  idType{Manu_ID,Dev_ID,Jedec_ID}   IDTYPE;                 /* 芯片ID类型                   */


/*********************************************************************************************************
  宏定义
*********************************************************************************************************/
/*
 *  定义操作MX25L1602所需的数据
 */
#ifndef MX_ERROR
#define MX_ERROR   0
#endif

#ifndef MX_OK
#define MX_OK      1
#endif

/*
 *  定义NorFlash芯片最大地址、最大扇区号、扇区大小
 */
#define MAX_ADDR       0x1FFFFF                                         /* 定义芯片内部最大地址         */
#define SEC_MAX        512                                              /* 定义最大扇区号               */
#define SEC_SIZE       0x1000                                           /* 扇区大小                     */



/*********************************************************************************************************
  函数声明
*********************************************************************************************************/
INT8U  mx25L1606Read(INT32U  ulDst,
                     INT8U*  pucRcvBufPt,
                     INT32U  ulNByte);


INT8U  mx25L1606ReadID(IDTYPE  eIDType,
                       INT32U* pulRcvbuf);


INT8U  mx25L1606Write(INT32U  ulDst,
                      INT8U*  pucSendbuf,
                      INT32U  ulNByte);


INT8U  mx25L1606Erase(INT32U  ulsec1,
                      INT32U  ulsec2);


#ifdef __cplusplus
}
#endif



#endif

/********************************************************************************************************
** End File
*********************************************************************************************************/
